Tekla.Structures.Model.Connection
The Connection class represents a connection. A connection is something that connects two or more parts together.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using Tekla.Structures;
using System;
public class Example
{
public void Example1()
{
Beam B1 = new Beam(new Point(15000,0,-500), new Point(15000,0,6000));
B1.Profile.ProfileString = "HEA400";
B1.Material.MaterialString = "S235JR";
Beam B2 = new Beam(new Point(15000,0,0), new Point(18000,0,0));
B2.Profile.ProfileString = "HEA400";
B2.Material.MaterialString = "S235JR";
B1.Insert();
B2.Insert();
Connection C = new Connection();
C.Name = "Test End Plate";
C.Number = 144;
C.LoadAttributesFromFile("standard");
C.UpVector = new Vector(0,0,1000);
C.PositionType = PositionTypeEnum.COLLISION_PLANE;
C.SetPrimaryObject(B1);
C.SetSecondaryObject(B2);
C.SetAttribute("e2", 10.0);
C.SetAttribute("e1", 10.0);
if(!C.Insert())
{
Console.WriteLine("Connection Insert failed");
}
else
{
Console.WriteLine(C.Identifier.ID);
Double DValue = 0.0;
if(!C.GetAttribute("e2", ref DValue) || DValue != 10)
Console.WriteLine("Connection GetAttribute failed");
}
}
}